import sqlite3

db = sqlite3.connect("database.db")
sql = db.cursor()

sql.execute("""CREATE TABLE IF NOT EXISTS data (
    film TEXT,
    rating REAL,
    release TEXT,
    style TEXT
)""")
db.commit()

# TODO: Увеличить базу данных
# TODO: Добавить к переменной style еще несколько переменных для более точного поиска фильмов
# TODO: Изменить возращаемые данные у переменой release
# '0000' -> '0000.00.00'

# ----------------------------------------------------------------------------------------------------------------------
# Данные возращаемы с базы данных
# film = 'Test'
# rating = 0 - 10
# release = '0000'
# style = 'test'
# ----------------------------------------------------------------------------------------------------------------------

# Типы сортировки
# ASC - От меньшего к большему
# DESC - От большего к меньшему
#
# SELECT * FROM data - Вывод информации с базы данных
